<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
    
<%--

	EL (Expression Language) : 표현식
	
	${출력물} => <%= %>
	  ----- 변수를 출력하는 것이 아니다
	  request에 있는 값, session, application, param
	  
	  => 연산자
	  	 이항연산자
	  	 --------
	  	 산술연산자 ( + - * / % )
	  	 		+ 는 산술만 처리(문자열 결합 X / += 문자열 결합)
	  	 		/ 는 정수/정수=실수, 0으로 나눌 수 없다
	  	 		null 값은 0으로 취급 => 연산이 가능
	  	 			/ (div) ${10 div 2}, ${10/2}	=> div 연산 기호
	  	 			% (mod) ${10 mod 2}, ${10%2}
	  	 비교연산자 ==, !=, <, >, <=, >=
	  	 		자바랑 다르다
	  	 		문자열이나 날짜 비교시에 동일하게 사용 "홍길동"==""
	  	 		== (eq)
	  	 		!= (ne)
	  	 		< (lt)
	  	 		> (gt)
	  	 		<= (le)
	  	 		>= (ge)
	  	 논리연산자
	  	 		&&, ||, !	
	  	 		and or not
	  	 --------
	  	 삼항연산자 : 조건?값:값
	  	 --------
	  	 기타연산자 : Empty => null, 공백인 경우 처리 => 사용 빈도는 거의 없다
	  	 
	
 --%>
    
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>

	<h1>산술연산자</h1>
	&#36;{10+10}=${10+10}
	<!-- 출력 : ${10+10}=20
		$#36; => $ 표시 -->
		
	<br>
	&#36;{"10"+10}=${"10"+10}
	<!-- 출력 : ${"10"+10}=20 -->
				 
	<br>
	&#36;{"10"+=10}=${"10"+=10}			 
	<!-- 출력 : ${"10"+=10}=1010
			+= 문자열 결합  -->		
	
	<br>
	&#36;{10/3}=${10/3}	
	<!-- 출력 : ${10/3}=3.3333333333333335
				정수/정수 = 실수  -->
	
	<br>
	&#36;{10 div 3}=${10 div 3}	
	<!--  ${10 div 3}=3.3333333333333335
			/ 는 div와 같다 -->
	
	<br>
	&#36;{10 % 3}=${10 % 3}	
	<!--  ${10 % 3}=1 -->
	
	<br>
	&#36;{10 mod 3}=${10 mod 3}	
	<!--  ${10 mod 3}=1 -->	
	
	<br>	
	&#36;{null + 10} = ${null+10}	
	<!--  ${null + 10} = 10
			null은 0으로 인식한다 -->	
	
<br>	
===================== 비교연산자 =====================
	<p>
	&#36;{"홍길동"=="심청이"}=${"홍길동"=="심청이" }
	<!--  ${"홍길동"=="심청이"}=false -->	
	
	<br>
	&#36;{"홍길동"=="홍길동"}=${"홍길동"=="홍길동" }
	<!--  ${"홍길동"=="홍길동"}=true -->
	
	<br>
	&#36;{"홍길동"=="홍길동"}=${"홍길동"=="홍길동" }<br>
	&#36;{"홍길동"!="홍길동"}=${"홍길동"!="홍길동" }<br>
	&#36;{"홍길동"<"심청이"}=${"홍길동"<"심청이" }<br>
	&#36;{"홍길동">"심청이"}=${"홍길동">"심청이" }<br>
	&#36;{"홍길동"<="심청이"}=${"홍길동"<="심청이" }<br>
	&#36;{"홍길동">="심청이"}=${"홍길동">="심청이" }<br>
	
	<!-- 
			${"홍길동"=="심청이"}=false
			${"홍길동"=="홍길동"}=true
			${"홍길동"=="홍길동"}=true
			${"홍길동"!="홍길동"}=false
			${"홍길동"<"심청이"}=false
			${"홍길동">"심청이"}=true
			${"홍길동"<="심청이"}=false
			${"홍길동">="심청이"}=true

			==> 가나다순의 비교
			
				== (eq)
	  	 		!= (ne)
	  	 		< (lt)
	  	 		> (gt)
	  	 		<= (le)
	  	 		>= (ge)
	  	 	==> 이것도 가능	 	
 	-->

===================== 논리연산자 =====================	
<br> 	
&#36;{10>6 && 5==6}=${10>6 && 5==6 }
<!-- false -->

<br> 	
&#36;{10>6 || 5==6}=${10>6 || 5==6 }
<!-- false -->


					 
</body>
</html>


